
/**
  *********************************************************************************************
  * @file           : MainTask.c
  * @brief          : PUD application functions
  * @author         : Artur Petrosyan, Home hand-made, Ltd.
  * @date           : 10/05/2024
  * @date           : 
  *
  * @note 
  *********************************************************************************************
*/

#include "main.h"
#include "pud.h"

void StartMainTask (void);

/**
 *********************************************************************************************
 * @brief Функция инициализации PUD
 *
 * @param [] None
 *
 * @retval [st] Статус инициализации
 *
 * @note
 *
 *********************************************************************************************
*/
uint8_t PUD_Init (void)
{
  return PUD_OK;
}


void StartMainTask (void)
{
    for (;;) {
        
    }
}
